zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_mcwdt.h
/** The MCWDT warn actions. */
/**
* \note
* Below enum is available for CAT1C and TVIIBE devices only.
*/
typedef enum
{
    CY_MCWDT_WARN_ACTION_NONE,
    CY_MCWDT_WARN_ACTION_INT,
} cy_en_mcwdt_warn_action_t;

#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) */

/** \} group_mcwdt_enums */

/**
* \addtogroup group_mcwdt_data_structures
* \{
*/

/** The MCWDT component configuration structure. */
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))
typedef struct
{
    uint16_t c0LowerLimit;                              /**< The sub-counter#0 lower limit value, for reset or fault.
                                                        Range: 0 - 65535 for c0AutoService = 0 and 1 - 65535 for c0AutoService = 1.
                                                        Only for CAT1C and TVIIBE devices*/
    uint16_t c0UpperLimit;                              /**< The sub-counter#0 upper limit value, for reset or fault.
                                                        Range: 0 - 65535 for c0AutoService = 0 and 1 - 65535 for c0AutoService = 1.
                                                        Only for CAT1C and TVIIBE devices*/
    uint16_t c0WarnLimit;                               /**< The sub-counter#0 warn limit value, for interrupt.
                                                        Range: 0 - 65535 for c0AutoService = 0 and 1 - 65535 for c0AutoService = 1.
                                                        Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_lower_upper_action_t  c0LowerAction;    /**< The sub-counter#0 action. It can have the following values:
                                                        \ref cy_en_mcwdt_lower_upper_action_t. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_lower_upper_action_t  c0UpperAction;    /**< The sub-counter#0 action. It can have the following values:
                                                        \ref cy_en_mcwdt_lower_upper_action_t. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_warn_action_t  c0WarnAction;            /**< The sub-counter#0 warn action. It can have the following values:
                                                        \ref cy_en_mcwdt_warn_action_t. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_enable_t     c0AutoService;             /**< The sub-counter#0 Auto Service parameter enabled/disabled.
                                                        Range: FALSE - TRUE. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_enable_t     c0SleepDeepPause;          /**< The sub-counter#0 Auto Service parameter enabled/disabled.
                                                        Range: FALSE - TRUE. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_enable_t     c0DebugRun;                /**< The sub-counter#0 Auto Service parameter enabled/disabled.
                                                        Range: FALSE - TRUE. Only for CAT1C and TVIIBE devices*/
    uint16_t c1LowerLimit;                              /**< The sub-counter#0 lower limit value, for reset or fault.
                                                        Range: 0 - 65535 for c1AutoService = 0 and 1 - 65535 for c1AutoService = 1.
                                                        Only for CAT1C and TVIIBE devices*/
    uint16_t c1UpperLimit;                              /**< The sub-counter#0 upper limit value, for reset or fault.
                                                        Range: 0 - 65535 for c1AutoService = 0 and 1 - 65535 for c1AutoService = 1.
                                                        Only for CAT1C and TVIIBE devices*/
    uint16_t c1WarnLimit;                               /**< The sub-counter#0 warn limit value, for interrupt.
                                                        Range: 0 - 65535 for c1AutoService = 0 and 1 - 65535 for c1AutoService = 1.
                                                        Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_lower_upper_action_t  c1LowerAction;    /**< The sub-counter#1 action. It can have the following values:
                                                        \ref cy_en_mcwdt_lower_upper_action_t. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_lower_upper_action_t  c1UpperAction;    /**< The sub-counter#1 action. It can have the following values:
                                                        \ref cy_en_mcwdt_lower_upper_action_t. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_warn_action_t  c1WarnAction;            /**< The sub-counter#1 warn action. It can have the following values:
                                                        \ref cy_en_mcwdt_warn_action_t. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_enable_t     c1AutoService;             /**< The sub-counter#1 Auto Service parameter enabled/disabled.
                                                        Range: FALSE - TRUE. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_enable_t     c1SleepDeepPause;          /**< The sub-counter#1 Auto Service parameter enabled/disabled.
                                                        Range: FALSE - TRUE. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_enable_t     c1DebugRun;                /**< The sub-counter#1 Auto Service parameter enabled/disabled.
                                                        Range: FALSE - TRUE. Only for CAT1C and TVIIBE devices*/
    uint32_t  c2ToggleBit;                              /**< The sub-counter#2 Period / Toggle Bit value. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_cnt2_action_t  c2Action;                /**< The sub-counter#2 mode. It can have the following values:
                                                        \ref cy_en_mcwdt_cnt2_action_t. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_enable_t     c2SleepDeepPause;          /**< The sub-counter#2 Auto Service parameter enabled/disabled.
                                                        Range: FALSE - TRUE. Only for CAT1C and TVIIBE devices*/
    cy_en_mcwdt_enable_t     c2DebugRun;                /**< The sub-counter#2 Auto Service parameter enabled/disabled. Only for CAT1C and TVIIBE devices **/

    cy_en_mcwdt_select_core_t coreSelect;               /**< Selecting the the core. The DeepSleep of the core pauses this MCWDT counter only for CAT1C and TVIIBE devices **/
} cy_stc_mcwdt_config_t;
#endif


#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || defined (CY_IP_MXS22SRSS)
/**
* \note
* Below structure variables are available for CAT1A (except TVIIBE), CAT1B and CAT1D devices.
**/
typedef struct
{
    uint16_t c0Match;        /**< The sub-counter#0 match comparison value, for interrupt or watchdog timeout.
                                  Range: 0 - 65535 for c0ClearOnMatch = 0 and 1 - 65535 for
                                  c0ClearOnMatch = 1. For CAT1A, CAT1B and CAT1D devices */
    uint16_t c1Match;        /**< The sub-counter#1 match comparison value, for interrupt or watchdog timeout.
                                  Range: 0 - 65535 for c1ClearOnMatch = 0 and 1 - 65535 for
                                  c1ClearOnMatch = 1. For CAT1A, CAT1B and CAT1D devices */
    uint8_t  c0Mode;         /**< The sub-counter#0 mode. It can have the following values: \ref CY_MCWDT_MODE_NONE,
                                  \ref CY_MCWDT_MODE_INT, \ref CY_MCWDT_MODE_RESET and \ref CY_MCWDT_MODE_INT_RESET.
                                  For CAT1A, CAT1B and CAT1D devices */
    uint8_t  c1Mode;         /**< The sub-counter#1 mode.  It can have the following values: \ref CY_MCWDT_MODE_NONE,
                                  \ref CY_MCWDT_MODE_INT, \ref CY_MCWDT_MODE_RESET and \ref CY_MCWDT_MODE_INT_RESET.
                                  For CAT1A, CAT1B and CAT1D devices */
    uint8_t  c2ToggleBit;    /**< The sub-counter#2 Period / Toggle Bit value.
                                  Range: 0 - 31. For CAT1A, CAT1B and CAT1D devices */
    uint8_t  c2Mode;         /**< The sub-counter#2 mode. It can have the following values: \ref CY_MCWDT_MODE_NONE
                                  and \ref CY_MCWDT_MODE_INT. For CAT1A, CAT1B and CAT1D devices */
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
    uint16_t c0LowerLimit;        /**< Lower limit for sub-counter 0 of this MCWDT.
                                  Range: 0 - 65535. Only for CAT1B devices */
    uint16_t c1LowerLimit;        /**< Lower limit for sub-counter 0 of this MCWDT.
                                  Range: 0 - 65535. Only for CAT1B devices */
    uint16_t c0LowerLimitMode;        /**< Watchdog Counter Action on service before lower limit.
                                  Range: 0 - 2., 0 - Do nothing, 1 - Assert WDT_INTx, 2 - Assert WDT Reset.
                                  Only for CAT1B devices */
    uint16_t c1LowerLimitMode;        /**< Watchdog Counter Action on service before lower limit.
                                  Range: 0 - 2., 0 - Do nothing, 1 - Assert WDT_INTx, 2 - Assert WDT Reset.
                                  Only for CAT1B devices */
#endif /* CY_IP_MXS28SRSS, CY_IP_MXS40SSRSS, CY_IP_MXS22SRSS */

/**
* \note
* This parameter is available for devices having MXS40SSRSS IP.
**/

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)
    bool  c0c1carryoutconfig;      /**< Carryout behaviour that applies when counter 0 and 1 are cascaded
                                      false: carry out on counter 0 match, true: carry out on counter 0 roll-over.
                                      Only for CAT1B devices */
    bool  c0c1matchconfig;         /**< Matching behaviour that applies when counter 0 and 1 are cascaded
                                      false: Match based on counter 1 alone, true: Match based on counter 1 and 0 simultaneously.
                                      Only for CAT1B devices */
    bool  c1c2carryoutconfig;      /**< Carryout behaviour that applies when counter 1 and 2 are cascaded
                                      false: carry out on counter 1 match, true: carry out on counter 1 roll-over.
                                      Only for CAT1B devices */
    bool  c1c2matchconfig;         /**< Matching behaviour that applies when counter 1 and 2 are cascaded
                                      false: Match based on counter 1 alone, true: Match based on counter 2 and 1 simultaneously.
                                      Only for CAT1B devices */
#endif /* CY_IP_MXS40SSRSS, CY_IP_MXS22SRSS */

    bool     c0ClearOnMatch; /**< The sub-counter#0 Clear On Match parameter enabled/disabled. For CAT1A, CAT1B and CAT1D devices */
    bool     c1ClearOnMatch; /**< The sub-counter#1 Clear On Match parameter enabled/disabled. For CAT1A, CAT1B and CAT1D devices */
    bool     c0c1Cascade;    /**< The sub-counter#1 is clocked by LFCLK or from sub-counter#0 cascade. For CAT1A, CAT1B and CAT1D devices */
    bool     c1c2Cascade;    /**< The sub-counter#2 is clocked by LFCLK or from sub-counter#1 cascade. For CAT1A, CAT1B and CAT1D devices */
} cy_stc_mcwdt_config_t;
#endif
/** \} group_mcwdt_data_structures */


