zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_mcwdt.h
    if (CY_MCWDT_LOWER_LIMIT0 == counter)
    {
        MCWDT_CONFIG(base) = _CLR_SET_FLD32U(MCWDT_CONFIG(base), MCWDT_STRUCT_MCWDT_CONFIG_WDT_LOWER_MODE0, mode);
    }
    else
    {
        MCWDT_CONFIG(base) = _CLR_SET_FLD32U(MCWDT_CONFIG(base), MCWDT_STRUCT_MCWDT_CONFIG_WDT_LOWER_MODE1, mode);
    }
}

/*******************************************************************************
* Function Name: Cy_MCWDT_GetLowerLimitMode
****************************************************************************//**
*
*  Reports the lower limit mode of the  specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-1].
*
*  \return
*  The current lower limit mode of the counter. See enum typedef cy_en_mcwdtlowerlimitmode_t.
*
* \note
* This API is available for CAT1B and CAT1D devices.
*
*******************************************************************************/
__STATIC_INLINE cy_en_mcwdtlowerlimitmode_t Cy_MCWDT_GetLowerLimitMode(MCWDT_STRUCT_Type const *base, cy_en_mcwdtlowerlimit_t counter)
{
    uint32_t getLowerLimitMode;

    CY_ASSERT_L3(CY_MCWDT_IS_LOWER_LIMIT_VALID(counter));

    if (CY_MCWDT_LOWER_LIMIT0 == counter)
    {
        getLowerLimitMode = _FLD2VAL(MCWDT_STRUCT_MCWDT_CONFIG_WDT_LOWER_MODE0, MCWDT_CONFIG(base));
    }
    else
    {
        getLowerLimitMode = _FLD2VAL(MCWDT_STRUCT_MCWDT_CONFIG_WDT_LOWER_MODE1, MCWDT_CONFIG(base));
    }

    return (cy_en_mcwdtlowerlimitmode_t)getLowerLimitMode;

}

/*******************************************************************************
* Function Name: Cy_MCWDT_GetLowerLimitCascaded
****************************************************************************//**
*
*  Gets lower limit registers cascaded value.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \note
*  The lower limit mode is not supported by Counter 2.
*
*  \return
*  A 32-bit lower limit register value.
*
* \note
* This API is available for CAT1B and CAT1D devices.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_MCWDT_GetLowerLimitCascaded(MCWDT_STRUCT_Type const *base)
{
    return (uint32_t)(MCWDT_LOWER_LIMIT(base));
}
#endif /* CY_IP_MXS28SRSS, CY_IP_MXS40SSRSS ,CY_IP_MXS22SRSS*/

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_MCWDT_SetCascadeCarryOutRollOver
****************************************************************************//**
*
*  Enables the Rollover mode for carryout.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*   The cascaded counter type. The valid cascaded type is either C0C1 or C1C2.
*
*  \param carryoutconfig
*   For CY_MCWDT_CASCADE_C0C1:
*   FALSE: carry out on counter 0 match
*   TRUE:  carry out on counter 0 rollover.
*   For CY_MCWDT_CASCADE_C1C2:
*   FALSE: carry out on counter 1 match
*   TRUE:  carry out on counter 1 rollover.
*
*  \note
*  This API is available for CAT1B and CAT1D devices.
*
*******************************************************************************/
__STATIC_INLINE void Cy_MCWDT_SetCascadeCarryOutRollOver(MCWDT_STRUCT_Type *base, cy_en_mcwdtcascade_t counter, bool carryoutconfig)
{
    CY_ASSERT_L3(CY_MCWDT_IS_CARRYMODE_CASCADE_VALID(counter));

    if (CY_MCWDT_CASCADE_C0C1 == counter)
    {
        MCWDT_CONFIG(base) = _CLR_SET_FLD32U(MCWDT_CONFIG(base), MCWDT_STRUCT_MCWDT_CONFIG_WDT_CARRY0_1, carryoutconfig);
    }
    else
    {
        MCWDT_CONFIG(base) = _CLR_SET_FLD32U(MCWDT_CONFIG(base), MCWDT_STRUCT_MCWDT_CONFIG_WDT_CARRY1_2, carryoutconfig);
    }
}

/*******************************************************************************
* Function Name: Cy_MCWDT_GetCascadeCarryOutModeRollOver
****************************************************************************//**
*
*  Checks if Rollover mode enabled for carryout or not.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The cascaded counter type. The valid cascaded type is either C0C1 or C1C2.
*
*  \return
*  True : Rollover Enabled
*  False : Rollover Disabled
*
* \note
* This API is available for CAT1B and CAT1D devices.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_MCWDT_GetCascadeCarryOutRollOver(MCWDT_STRUCT_Type const *base, cy_en_mcwdtcascade_t counter)
{
    bool countVal = false;

    CY_ASSERT_L3(CY_MCWDT_IS_CARRYMODE_CASCADE_VALID(counter));

    switch (counter)
    {
        case CY_MCWDT_CASCADE_C0C1:
            countVal = _FLD2BOOL(MCWDT_STRUCT_MCWDT_CONFIG_WDT_CARRY0_1, MCWDT_CONFIG(base));
            break;
        case CY_MCWDT_CASCADE_C1C2:
            countVal = _FLD2BOOL(MCWDT_STRUCT_MCWDT_CONFIG_WDT_CARRY1_2, MCWDT_CONFIG(base));
            break;
        default:
            CY_ASSERT(0u != 0u);
        break;
    }

    return (countVal);
}

/*******************************************************************************
* Function Name: Cy_MCWDT_SetCascadeMatchCombined
****************************************************************************//**
*
*  Sets the match to combined cascade counters.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*   The cascaded counter type. The valid cascaded type is either C0C1 or C1C2.
*
*  \param matchconfig
*   For CY_MCWDT_CASCADE_C0C1:
*   FALSE: Match based on counter 1 alone
*   TRUE:  Match based on counter 1 and counter 0 matching simultaneously
*   For CY_MCWDT_CASCADE_C1C2:
*   FALSE: Match based on counter 2 alone
*   TRUE:  Match based on counter 2 and counter 1 matching simultaneously
*
*  \note
*  This API is available for CAT1B and CAT1D devices.
*
*******************************************************************************/
__STATIC_INLINE void Cy_MCWDT_SetCascadeMatchCombined(MCWDT_STRUCT_Type *base, cy_en_mcwdtcascade_t counter, bool matchconfig)
{
    if (CY_MCWDT_CASCADE_C0C1 == counter)
    {
        MCWDT_CONFIG(base) = _CLR_SET_FLD32U(MCWDT_CONFIG(base), MCWDT_STRUCT_MCWDT_CONFIG_WDT_MATCH0_1, matchconfig);
    }
    else
    {
        MCWDT_CONFIG(base) = _CLR_SET_FLD32U(MCWDT_CONFIG(base), MCWDT_STRUCT_MCWDT_CONFIG_WDT_MATCH1_2, matchconfig);
    }
}

